OpenFOAM-13/tutorials/multiphaseEuler/LBend/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (solids gas);

solids
{
    type            purePhaseModel;

    diameterModel   constant;

    constantCoeffs
    {
        d               462e-6;
    }

    alphaMax        0.65;
    residualAlpha   1e-5;
}

gas
{
    type            purePhaseModel;

    diameterModel   none;

    residualAlpha   1e-5;
}

blending
{
    default
    {
        type            continuous;
        phase           gas;
    }
}

surfaceTension
{
    gas_solids
    {
        type            constant;
        sigma           0;
    }
}

// ************************************************************************* //
